Repository: Nil-Devops/SketchUp-PBR-Plugin
Catalog: source/pbr/Resources/*/pbr.strings
Languages: fr

source: Physically-Based Rendering
fr: Rendu basé sur la physique

source: Add reflects, reliefs and lights to your SketchUp models.
fr: Ajoutez des reflets, reliefs et lumières à vos modèles SketchUp.

source: Get a render in seconds.
fr: Obtenez un rendu en quelques secondes.

source: Control camera in real-time.
fr: Contrôlez la caméra en temps réel.

source: Export result to image or 3D object.
fr: Exportez le résultat en image ou en objet 3D.

source: Please install required plugin: glTF Export.
fr: Veuillez installer le plugin requis : glTF Export.

source: A newer version of the PBR plugin is available:
fr: Une version plus récente du plugin PBR est disponible :

source: Change HDR Background...
fr: Changer l'image de fond HDR...

source: Select New Background
fr: Sélectionner la nouvelle image de fond

source: HDR Image
fr: Image HDR

source: Edit Materials...
fr: Modifier les matériaux...

source: Add an Artificial Light
fr: Ajouter une lumière artificielle

source: Render Scene in Viewport
fr: Rendre la scène dans la fenêtre de visu.

source: Track all Changes
fr: Suivre tous les changements

source: Export as 3D Object...
fr: Exporter en tant qu'objet 3D...

source: Donate to Plugin Author
fr: Faire un don à l'auteur de l'extension

source: PBR
fr: RBP

source: Define if a material is rough, is a metal, etc.
fr: Définissez si un matériau est rugueux, est un métal, etc.

source: Move it in space. Change its color.
fr: Déplacez-la dans l'espace. Changez sa couleur.

source: This will reopen Viewport.
fr: Ceci réouvrira la fenêtre de visualisation.

source: Save 3D model as .gltf.
fr: Enregistrez le modèle 3D en tant que .gltf.

source: PBR Material Editor
fr: Interface de modification des matériaux RBP

source: PBR Material Editor is already open.
fr: L'interface de modification des matériaux RBP est déjà ouverte.

source: Wait, there is no material to edit :p
fr: Attendez, il n'y a aucun matériau à éditer :p

source: Occlusion map
fr: Carte d'occlusion

source: In [ambient] occlusion map, higher values indicate areas that should receive full indirect lighting and lower values indicate no indirect lighting.
fr: Dans la carte d'occlusion [ambiante], les valeurs les plus hautes indiquent les zones qui doivent recevoir un éclairage indirect complet et les valeurs les plus basses indiquent l'absence d'éclairage indirect.

source: Height map
fr: Champ de hauteur

source: The height map gives a great illusion of relief to the material.
fr: Le champ de hauteur donne une grande illusion de relief au matériau.

source: To use in parallel with a normal map.
fr: A utiliser en parallèle avec une carte de normales.

source: Metallic
fr: Métallique

source: A value of 0 means the material is a dielectric.
fr: Une valeur de 0 signifie que le matériau est un diélectrique.

source: A value of 1 means the material is a metal.
fr: Une valeur de 1 signifie que le matériau est un métal.

source: When a metallic texture is specified, this value becomes a multiplier for each pixel of that metallic texture.
fr: Lorsqu'une texture métallique est spécifiée, cette valeur devient un multiplicateur pour chaque pixel de cette texture métallique.

source: Metallic map
fr: Carte métallique

source: The metallic map is more precise than single value of Metallic.
fr: La carte métallique est plus précise que la valeur unique Métallique.

source: Metallic and roughness maps are automatically merged.
fr: Les cartes métalliques et de rugosité sont automatiquement fusionnées.

source: Normal map
fr: Carte de normales

source: The normal map gives an illusion of relief to the material.
fr: La carte de normales donne une illusion de relief au matériau.

source: Relief information is stored in image using RGB components in linear space.
fr: Les informations de relief sont stockées dans l'image en utilisant les composantes RVB dans l'espace linéaire.

source: Normal map scale
fr: Echelle de la carte de normales

source: The scalar multiplier applied to each vector of the normal map.
fr: Le multiplicateur scalaire appliqué à chaque vecteur de la carte de normales.

source: Adjust strength of relief with this value.
fr: Ajustez la force du relief avec cette valeur.

source: Roughness
fr: Rugosité

source: A value of 0 means the material is completely smooth.
fr: Une valeur de 0 signifie que le matériau est complètement lisse.

source: A value of 1 means the material is completely rough.
fr: Une valeur de 1 signifie que le matériau est complètement rugueux.

source: When a roughness texture is specified, this value becomes a multiplier...
fr: Lorsqu'une texture de rugosité est spécifiée, cette valeur devient un multiplicateur...

source: Roughness map
fr: Carte de rugosité

source: The roughness map is more precise than single value of Roughness.
fr: La carte de rugosité est plus précise que la valeur unique Rugosité.

source: The image format of this map must be JPEG or PNG.
fr: Le format d'image de cette carte doit être JPEG ou PNG.

source: A texture image is defined?
fr: Une image de texture est définie ?

source: Discard texture image
fr: Jeter l'image de texture

source: Alpha mode
fr: Mode alpha

source: Fully opaque
fr: Complètement opaque

source: Fully opaque or transparent
fr: Complètement opaque ou transparent

source: Combined with background
fr: Combiné avec l'arrière-plan

source: The alpha rendering mode of the material.
fr: Le mode de rendu alpha du matériau.

source: Another operation is in progress. Please retry later.
fr: Une autre opération est en cours. Veuillez réessayer plus tard.

source: Apply all changes
fr: Appliquer tous les changements

source: Untitled
fr: Sans titre

source: Export as glTF
fr: Exporter en tant que fichier glTF

source: Model well exported here:
fr: Modèle bien exporté ici :

source: glTF export failed. Do you want help?
fr: L'export glTF a échoué. Voulez-vous de l'aide ?

source: Export geometry and textures to glTF format
fr: Export de la géométrie et des textures au format glTF

source: PBR: Exporting geometry and textures... Please wait.
fr: RBP : Export de la géométrie et des textures en cours... Veuillez patienter.

source: help.md#in-pbr-viewport
fr: aide.md#dans-la-fenêtre-de-visualisation-rbp

source: help.md#in-sketchup
fr: aide.md#dans-sketchup

source: SketchUp PBR Viewport
fr: Fenêtre de visu. RBP de SketchUp

source: Sunlight intensity
fr: Intensité de la lumière du soleil

source: Help
fr: Aide

source: Reset camera position
fr: Réinitialiser la position de la caméra
